app/controllers/answers_controller.rb

INSERT INTO "answers" ("question_id", "content", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 1], ["content", "アメダスによると晴れです"], ["name", "さすらいの行商人"], ["created_at", "2017-05-10 08:21:55.754241"], ["updated_at", "2017-05-10 08:21:55.754241"]]
SELECT COUNT(*) FROM "answers" WHERE (question_id = 2)
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    end_counter = 100
    @answer = Answer.new(answer_params)
    respond_to do |format|
      if @answer.save
        num = Answer.where('question_id = ?', @answer.question_id).count
        if num >= end_counter
          q = Question.find @answer.question_id

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_answer
      @answer = Answer.find(params[:id])