app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order created_at: :desc
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "name", "finished", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "明日の天気は？"], ["content", "明日の天気が知りたいです"], ["name", "さすらいのサムライ"], ["finished", "f"], ["created_at", "2017-05-10 08:20:39.986834"], ["updated_at", "2017-05-10 08:20:39.986834"]]